import Header from "../../components/Header"
import Footer from "../../components/Footer"

const Terms = () => {
    return (
        <>
            <Header />

            <h1>Условия использования</h1>
            <p>Последнее обновление: 7.12.2025</p>
            <p>Сайт: https://flybuk.alwaysdata.net</p>

            <p>Пожалуйста, внимательно прочтите настоящие Условия использования Условия использования перед использованием сайта hanyo (далее — «Сайт», «Мы», «Наш сервис»).
                Получая доступ к Сайту или используя его, вы («Пользователь», «Вы») соглашаетесь соблюдать данные Условия.</p>

            <p>Если вы не согласны с какими-либо положениями, пожалуйста, прекратите использование Сайта.</p>

            <h2>1. Общие положения</h2>
            <p>1.1. Настоящие Условия регулируют использование Сайта и всего опубликованного на нём контента.</p>
            <p>1.2. Мы оставляем за собой право изменять или обновлять Условия в любое время. Изменения вступают в силу после опубликования на данной странице.</p>
            <p>1.3. Продолжая пользоваться Сайтом после изменения Условий, вы подтверждаете свое согласие с обновлённой версией.</p>

            <h2>Контент</h2>
            <p>2.1. Весь контент Сайта, включая тексты, изображения, переводы, оригинальные произведения и другие материалы (далее — «Контент»), защищён авторским правом.</p>
            <p>2.2. Запрещается копировать, распространять или использовать Контент без разрешения правообладателя.</p>
            <p>2.3. Размещённые переводы могут являться адаптациями оригинальных произведений. Все права на оригиналы принадлежат их авторам и издателям.</p>

            <h2>3. Использование Сайта</h2>

            <Footer />
        </>
    )
}

export default Terms
