import Header from "../../components/Header"
import Footer from "../../components/Footer"

const Terms = () => {
    return (
        <>
            <Header />

            <h1>Условия использования</h1>
            <p>Последнее обновление: 7.12.2025</p>
            <p>Сайт: https://hanyo.org</p>

            <p>Пожалуйста, внимательно прочтите настоящие Условия использования Условия использования перед использованием сайта hanyo (далее — «Сайт», «Мы», «Наш сервис»).
                Получая доступ к Сайту или используя его, вы («Пользователь», «Вы») соглашаетесь соблюдать данные Условия.</p>

            <p>Если вы не согласны с какими-либо положениями, пожалуйста, прекратите использование Сайта.</p>

            <h2>1. Общие положения</h2>
            <p>1.1. Настоящие Условия регулируют использование Сайта и всего опубликованного на нём контента.</p>
            <p>1.2. Мы оставляем за собой право изменять или обновлять Условия в любое время. Изменения вступают в силу после опубликования на данной странице.</p>
            <p>1.3. Продолжая пользоваться Сайтом после изменения Условий, вы подтверждаете свое согласие с обновлённой версией.</p>

            <h2>Контент</h2>
            <p>2.1. Весь контент Сайта, включая тексты, изображения, переводы, оригинальные произведения и другие материалы (далее — «Контент»), защищён авторским правом.</p>
            <p>2.2. Запрещается копировать, распространять или использовать Контент без разрешения правообладателя.</p>
            <p>2.3. Размещённые переводы могут являться адаптациями оригинальных произведений. Все права на оригиналы принадлежат их авторам и издателям.</p>

            <h2>3. Использование Сайта</h2>
            <p>3.1. Вы соглашаетесь не использовать Сайт для незаконной деятельности, распространения вредоносного ПО, спама или попыток нарушения безопасности сервиса.</p>
            <p>3.2. Вы обязуетесь не вмешиваться в работу Сайта, не пытаться получить несанкционированный доступ к серверам или данным.</p>
            <p>3.3. При размещении комментариев или других данных вы подтверждаете, что они не нарушают законодательство и права третьих лиц.</p>

            <h2>4. Аккаунты</h2>
            <p>4.1. Создавая аккаунт, вы обязаны предоставить точные и актуальные данные.</p>
            <p>4.2. Вы несёте ответственность за сохранность пароля и действий, совершённых через аккаунт.</p>
            <p>4.3. Мы можем заблокировать или удалить аккаунт в случае нарушения Условий.</p>

            <h2>5. Платный контент / Подписка</h2>
            <p>5.1. Некоторые материалы могут быть доступны только по подписке или платным доступом.</p>
            <p>5.2. Оплата осуществляется через сторонние сервисы, и мы не храним данные банковских карт.</p>
            <p>5.3. Возврат средств возможен только в соответствии с правилами соответствующей платёжной системы.</p>

            <h2>6. Ссылки на сторонние ресурсы</h2>
            <p>6.1. Сайт может содержать ссылки на сторонние сайты.</p>
            <p>6.2. Мы не контролируем эти ресурсы и не несем ответственности за их содержание или политику конфиденциальности.</p>

            <h2>7. Ограничение ответственности</h2>
            <p>7.1. Сайт предоставляется «как есть», без гарантий точности, полноты, безопасности или доступности в любое время.</p>
            <p>7.2. Мы не несем ответственности за возможные убытки, связанные с использованием Сайта.</p>

            <h2>8. Политика конфиденциальности</h2>
            <p>8.1. Использование Сайта также регулируется нашей Политикой конфиденциальности.</p>
            <p>8.2. Ознакомиться с ней можно по ссылке: https://hanyo.org/policy</p>

            <h2>9. Применимое право</h2>
            <p>9.1. Настоящие Условия регулируются законодательством Республики Молдова.</p>
            <p>9.2. Все споры решаются в соответствии с действующим законодательством.</p>

            <h2>10. Контакты</h2>
            <p>Если у вас есть вопросы по Условиям использования, свяжитесь с нами: Email: <a href="mailto:flybuk@icloud.com"><i>flybuk@icloud.com</i></a></p>

            <Footer />
        </>
    )
}

export default Terms
